{
  "_source": "International Meteor Organization (IMO) 2026 Meteor Shower Calendar - https://www.imo.net/resources/calendar/",
  "_lastUpdated": "2026-02-02",
  "showers": [
    {
      "id": "quadrantids",
      "code": "QUA",
      "name": "Quadrantids",
      "activePeriod": {
        "start": "December 28",
        "end": "January 12"
      },
      "peak": {
        "month": 1,
        "dayOfMonth": 3
      },
      "zhr": 120,
      "velocity": {
        "kmPerSec": 40.4,
        "category": "medium"
      },
      "radiant": {
        "ra": "15:20",
        "dec": "+49°",
        "constellation": "Boötes"
      },
      "parentObject": {
        "name": "2003 EH1",
        "type": "asteroid"
      },
      "moonPhase2026": {
        "percentIlluminated": 99,
        "phaseName": "full moon"
      },
      "hemisphere": {
        "preference": "northern",
        "note": "Not well seen from the southern hemisphere"
      },
      "description": "The Quadrantids have the potential to be the strongest shower of the year, with a ZHR rivaling even the Geminids — but they're notoriously hard to catch. Their peak lasts only about six hours, and early January weather often conspires against observers. Like the Geminids, the Quadrantids trace back to a rocky body rather than a comet: the asteroid 2003 EH1, thought to be a fragment of an extinct comet. The meteors themselves are medium-speed, often producing bright fireballs but rarely leaving persistent trains. In 2026, a nearly full moon will wash out all but the brightest Quadrantids, making this a tough year for the shower.",
      "image": "/shower-images/quadrantids.jpg"
    },
    {
      "id": "lyrids",
      "code": "LYR",
      "name": "Lyrids",
      "activePeriod": {
        "start": "April 14",
        "end": "April 30"
      },
      "peak": {
        "month": 4,
        "dayOfMonth": 22
      },
      "zhr": 18,
      "velocity": {
        "kmPerSec": 49,
        "category": "medium"
      },
      "radiant": {
        "ra": "18:04",
        "dec": "+34°",
        "constellation": "Lyra"
      },
      "parentObject": {
        "name": "C/1861 G1 (Thatcher)",
        "type": "comet"
      },
      "moonPhase2026": {
        "percentIlluminated": 27,
        "phaseName": "waxing crescent"
      },
      "hemisphere": {
        "preference": "northern",
        "note": "Best from northern hemisphere; visible at lower rates from south"
      },
      "description": "One of the oldest recorded meteor showers, the Lyrids have been observed for over 2,700 years — Chinese records describe them as far back as 687 BC. They're a modest but reliable spring shower, typically producing good rates for three nights around the peak. The meteors are medium-speed, occasionally producing fireballs though generally lacking persistent trains. Their parent comet, C/1861 G1 (Thatcher), won't return to the inner solar system until 2276. In 2026, a slim waxing crescent moon sets early, leaving dark skies for the peak — excellent conditions.",
      "image": "/shower-images/lyrids.jpg"
    },
    {
      "id": "eta-aquariids",
      "code": "ETA",
      "name": "Eta Aquariids",
      "activePeriod": {
        "start": "April 19",
        "end": "May 28"
      },
      "peak": {
        "month": 5,
        "dayOfMonth": 6
      },
      "zhr": 50,
      "velocity": {
        "kmPerSec": 65.4,
        "category": "swift"
      },
      "radiant": {
        "ra": "22:32",
        "dec": "-1°",
        "constellation": "Aquarius"
      },
      "parentObject": {
        "name": "1P/Halley",
        "type": "comet"
      },
      "moonPhase2026": {
        "percentIlluminated": 84,
        "phaseName": "waning gibbous"
      },
      "hemisphere": {
        "preference": "southern",
        "note": "Best from southern tropics; medium rates from equator northward"
      },
      "description": "Every May, Earth passes through debris shed by the most famous comet of all — 1P/Halley. The Eta Aquariids are the first of two annual encounters with Halley's dust (the Orionids in October are the second). These are swift meteors, striking the atmosphere at 65 km/s, and they leave a high percentage of glowing persistent trains in their wake. Activity is good for a full week around the peak. In 2026, a bright waning gibbous moon will compete with all but the brightest meteors, making this a challenging year for the shower.",
      "image": "/shower-images/eta-aquariids.jpg"
    },
    {
      "id": "southern-delta-aquariids",
      "code": "SDA",
      "name": "Southern Delta Aquariids",
      "activePeriod": {
        "start": "July 12",
        "end": "August 23"
      },
      "peak": {
        "month": 7,
        "dayOfMonth": 31
      },
      "zhr": 25,
      "velocity": {
        "kmPerSec": 41,
        "category": "medium"
      },
      "radiant": {
        "ra": "22:40",
        "dec": "-16.4°",
        "constellation": "Aquarius"
      },
      "parentObject": {
        "name": "96P/Machholz",
        "type": "comet"
      },
      "moonPhase2026": {
        "percentIlluminated": 98,
        "phaseName": "full moon"
      },
      "hemisphere": {
        "preference": "southern",
        "note": "Best from southern tropics; lower rates north of equator"
      },
      "description": "A steady midsummer shower linked to the enigmatic comet 96P/Machholz, the Southern Delta Aquariids produce good rates for a full week around their broad maximum. The meteors are typically faint and unassuming — they lack both persistent trains and fireballs — but their consistency makes them a reliable companion to late-July skywatching. They peak on the same night as the Alpha Capricornids, and the two showers can be enjoyed together. In 2026, a nearly full moon on peak night will unfortunately drown out most of these already-faint meteors.",
      "image": "/shower-images/southern-delta-aquariids.jpg"
    },
    {
      "id": "alpha-capricornids",
      "code": "CAP",
      "name": "Alpha Capricornids",
      "activePeriod": {
        "start": "July 3",
        "end": "August 15"
      },
      "peak": {
        "month": 7,
        "dayOfMonth": 31
      },
      "zhr": 5,
      "velocity": {
        "kmPerSec": 23,
        "category": "slow"
      },
      "radiant": {
        "ra": "20:28",
        "dec": "-10°",
        "constellation": "Capricornus"
      },
      "parentObject": {
        "name": "169P/NEAT",
        "type": "comet"
      },
      "moonPhase2026": {
        "percentIlluminated": 98,
        "phaseName": "full moon"
      },
      "hemisphere": {
        "preference": "both",
        "note": "Seen equally well from both hemispheres"
      },
      "description": "What the Alpha Capricornids lack in numbers they make up for in spectacle. With a ZHR of just 5, this is one of the weakest major showers — but it's known for producing bright, slow-moving fireballs that can light up the sky. The meteors crawl across the atmosphere at only 23 km/s, among the slowest of any shower, giving them a distinctive lazy arc. Their plateau-like maximum spans several weeks, making them forgiving to observe. In 2026, a nearly full moon will challenge observers, though the shower's signature fireballs may still punch through the moonlight.",
      "image": "/shower-images/alpha-capricornids.jpg"
    },
    {
      "id": "perseids",
      "code": "PER",
      "name": "Perseids",
      "activePeriod": {
        "start": "July 17",
        "end": "August 24"
      },
      "peak": {
        "month": 8,
        "dayOfMonth": 12
      },
      "zhr": 100,
      "velocity": {
        "kmPerSec": 59,
        "category": "swift"
      },
      "radiant": {
        "ra": "03:12",
        "dec": "+58.1°",
        "constellation": "Perseus"
      },
      "parentObject": {
        "name": "109P/Swift-Tuttle",
        "type": "comet"
      },
      "moonPhase2026": {
        "percentIlluminated": 0,
        "phaseName": "new moon"
      },
      "hemisphere": {
        "preference": "northern",
        "note": "Best from northern hemisphere; reduced rates from south"
      },
      "description": "The Perseids are the crowd favorite — peaking on warm August nights, they're the shower most people have actually seen. Born from comet 109P/Swift-Tuttle (the single most dangerous object known to humanity, due to its size and Earth-crossing orbit), the Perseids are swift, bright, and frequently leave persistent trains. Rates from dark rural locations typically reach 50-100 per hour at maximum, with colorful fireballs punctuating the display. In 2026, a new moon on peak night means perfectly dark skies — this will be one of the best Perseid displays in years.",
      "image": "/shower-images/perseids.jpg"
    },
    {
      "id": "orionids",
      "code": "ORI",
      "name": "Orionids",
      "activePeriod": {
        "start": "October 2",
        "end": "November 7"
      },
      "peak": {
        "month": 10,
        "dayOfMonth": 21
      },
      "zhr": 20,
      "velocity": {
        "kmPerSec": 66,
        "category": "swift"
      },
      "radiant": {
        "ra": "06:20",
        "dec": "+15.8°",
        "constellation": "Orion"
      },
      "parentObject": {
        "name": "1P/Halley",
        "type": "comet"
      },
      "moonPhase2026": {
        "percentIlluminated": 80,
        "phaseName": "waxing gibbous"
      },
      "hemisphere": {
        "preference": "both",
        "note": "Visible from both hemispheres"
      },
      "description": "Earth's second annual encounter with the debris of Halley's Comet, the Orionids are the autumn counterpart to May's Eta Aquariids. These are among the fastest meteors you'll see — at 66 km/s, they streak across the sky and frequently leave glowing persistent trains. In typical years, expect 10-20 meteors per hour, though the shower has surprised observers before: between 2006 and 2009, rates surged to rival the Perseids. The radiant sits near Orion's club, appearing in the east after midnight. In 2026, a waxing gibbous moon at 80% illumination will hinder observations of fainter meteors.",
      "image": "/shower-images/orionids.jpg"
    },
    {
      "id": "southern-taurids",
      "code": "STA",
      "name": "Southern Taurids",
      "activePeriod": {
        "start": "September 20",
        "end": "November 20"
      },
      "peak": {
        "month": 11,
        "dayOfMonth": 5
      },
      "zhr": 5,
      "velocity": {
        "kmPerSec": 27,
        "category": "slow"
      },
      "radiant": {
        "ra": "03:28",
        "dec": "+14.5°",
        "constellation": "Taurus"
      },
      "parentObject": {
        "name": "2P/Encke",
        "type": "comet"
      },
      "moonPhase2026": {
        "percentIlluminated": 18,
        "phaseName": "waning crescent"
      },
      "hemisphere": {
        "preference": "both",
        "note": "Visible from both hemispheres"
      },
      "description": "The Southern Taurids are the first act of autumn's fireball season. Spawned by the short-period comet 2P/Encke, this is a complex shower with two components: an annual stream peaking around October 14 and a fireball swarm peaking on November 5. The meteors are slow, entering at 27 km/s, and what they lack in speed they make up for in brilliance — the Taurids are responsible for a disproportionate share of fireball reports each fall. In 2026, a thin waning crescent moon leaves the sky dark for the November 5 fireball peak — ideal conditions for catching these slow, bright bolides.",
      "image": "/shower-images/southern-taurids.jpg"
    },
    {
      "id": "northern-taurids",
      "code": "NTA",
      "name": "Northern Taurids",
      "activePeriod": {
        "start": "October 20",
        "end": "December 10"
      },
      "peak": {
        "month": 11,
        "dayOfMonth": 12
      },
      "zhr": 5,
      "velocity": {
        "kmPerSec": 29,
        "category": "slow"
      },
      "radiant": {
        "ra": "03:52",
        "dec": "+22.2°",
        "constellation": "Taurus"
      },
      "parentObject": {
        "name": "2P/Encke",
        "type": "comet"
      },
      "moonPhase2026": {
        "percentIlluminated": 7,
        "phaseName": "waxing crescent"
      },
      "hemisphere": {
        "preference": "both",
        "note": "Visible from both hemispheres"
      },
      "description": "The Northern Taurids are the sibling stream to the Southern Taurids, both born from comet 2P/Encke's ancient debris field. Peaking about a week later, this shower shares the same slow, fireball-rich character. When both streams are active simultaneously in late October and early November, the combined Taurid complex can produce a memorable uptick in bright fireballs — sometimes called \"Halloween fireballs.\" In 2026, a razor-thin waxing crescent at just 7% illumination means near-perfect dark skies for the November 12 peak.",
      "image": "/shower-images/northern-taurids.jpg"
    },
    {
      "id": "leonids",
      "code": "LEO",
      "name": "Leonids",
      "activePeriod": {
        "start": "November 6",
        "end": "November 30"
      },
      "peak": {
        "month": 11,
        "dayOfMonth": 17
      },
      "zhr": 15,
      "velocity": {
        "kmPerSec": 69.7,
        "category": "swift"
      },
      "radiant": {
        "ra": "10:08",
        "dec": "+21.8°",
        "constellation": "Leo"
      },
      "parentObject": {
        "name": "55P/Tempel-Tuttle",
        "type": "comet"
      },
      "moonPhase2026": {
        "percentIlluminated": 45,
        "phaseName": "first quarter"
      },
      "hemisphere": {
        "preference": "both",
        "note": "Visible from both hemispheres"
      },
      "description": "The Leonids carry a legendary reputation. In 1833, their storm produced an estimated 100,000 meteors per hour — an event so dramatic it helped launch the scientific study of meteors. Historic storms also erupted in 1866, 1966, 1999, 2001, and 2002, all tied to close passes of the parent comet 55P/Tempel-Tuttle. At nearly 70 km/s, these are among the fastest meteors of any shower, and they frequently leave bright, lingering persistent trains. In non-storm years like 2026, expect a modest 10-15 per hour. A first-quarter moon at 45% will set around midnight, leaving the best morning hours dark. The next Leonid storm isn't expected until 2099.",
      "image": "/shower-images/leonids.jpg"
    },
    {
      "id": "geminids",
      "code": "GEM",
      "name": "Geminids",
      "activePeriod": {
        "start": "December 4",
        "end": "December 17"
      },
      "peak": {
        "month": 12,
        "dayOfMonth": 14
      },
      "zhr": 150,
      "velocity": {
        "kmPerSec": 35,
        "category": "medium"
      },
      "radiant": {
        "ra": "07:28",
        "dec": "+33°",
        "constellation": "Gemini"
      },
      "parentObject": {
        "name": "3200 Phaethon",
        "type": "asteroid"
      },
      "moonPhase2026": {
        "percentIlluminated": 21,
        "phaseName": "waxing crescent"
      },
      "hemisphere": {
        "preference": "northern",
        "note": "Best from northern hemisphere; reduced rates from south"
      },
      "description": "The Geminids are the king of meteor showers — reliably the strongest annual display, with a ZHR of 150. Unlike nearly every other shower, the Geminids originate not from a comet but from an asteroid, 3200 Phaethon, a mysterious rock-comet hybrid that may be slowly disintegrating under the sun's heat. The meteors are medium-speed at 35 km/s, often bright, and intensely colored in whites, yellows, and occasional blues and greens. Persistent trains are rare due to the moderate velocity. Uniquely, Gemini is well-placed by 10 PM, making this one of the few major showers that reward early-evening observers. In 2026, a 21% waxing crescent moon sets early, leaving dark skies through the night — outstanding conditions.",
      "image": "/shower-images/geminids.jpg"
    },
    {
      "id": "ursids",
      "code": "URS",
      "name": "Ursids",
      "activePeriod": {
        "start": "December 17",
        "end": "December 26"
      },
      "peak": {
        "month": 12,
        "dayOfMonth": 22
      },
      "zhr": 10,
      "velocity": {
        "kmPerSec": 33.1,
        "category": "medium"
      },
      "radiant": {
        "ra": "14:28",
        "dec": "+76°",
        "constellation": "Ursa Minor"
      },
      "parentObject": {
        "name": "8P/Tuttle",
        "type": "comet"
      },
      "moonPhase2026": {
        "percentIlluminated": 94,
        "phaseName": "waxing gibbous"
      },
      "hemisphere": {
        "preference": "northern",
        "note": "Strictly a northern hemisphere event"
      },
      "description": "The Ursids are the year's quiet finale — peaking just before Christmas, they're often overlooked in the afterglow of the Geminids a week earlier. Produced by comet 8P/Tuttle, the shower typically delivers 5-10 meteors per hour in the late-night and morning hours. But the Ursids have a wild side: occasional outbursts have pushed rates above 25 per hour, as occurred in 1945 and 1986. With a radiant near Polaris at +76° declination, these meteors are circumpolar from northern latitudes and never dip below the horizon. In 2026, a bright 94% waxing gibbous moon will make it a difficult year, limiting visibility to only the brightest Ursid meteors.",
      "image": "/shower-images/ursids.jpg"
    }
  ]
}
